// SPDX-License-Identifier: MIT
pragma solidity ^0.8.31;

/*
    ██╗     ██╗   ██╗██╗  ██╗    ██████╗ ███╗   ██╗██████╗
    ██║     ██║   ██║╚██╗██╔╝    ██╔══██╗████╗  ██║██╔══██╗
    ██║     ██║   ██║ ╚███╔╝     ██████╔╝██╔██╗ ██║██████╔╝
    ██║     ██║   ██║ ██╔██╗     ██╔══██╗██║╚██╗██║██╔══██╗
    ███████╗╚██████╔╝██╔╝ ██╗    ██████╔╝██║ ╚████║██████╔╝
    ╚══════╝ ╚═════╝ ╚═╝  ╚═╝    ╚═════╝ ╚═╝  ╚═══╝╚═════╝
 */

import { LRC20B } from "../../bridge/LRC20B.sol";

contract LuxBNB is LRC20B {
    constructor() LRC20B("Liquid BNB", "LBNB") { }

    function mint(address account, uint256 amount) public onlyAdmin {
        _mint(account, amount);
    }

    function burn(address account, uint256 amount) public onlyAdmin {
        _burn(account, amount);
    }
}
